/*
Localizable.strings
PanicGit

Created by Logan Collins on 2/24/18.
Copyright © 2018 Panic Inc. All rights reserved.
*/


// Operations

// "Downloading Objects: 12 of 100 (100KB)"
"Downloading Objects: %@ of %@ (%@)" = "Téléchargement des objets : %@ sur %@ (%@)";

// "Indexing Deltas: 12 of 100"
"Indexing Deltas: %@ of %@" = "Indexation des deltas : %@ sur %@";

// "Packing Objects: 12 of 100"
"Packing Objects: %@ of %@" = "Compression des objets : %@ sur %@";

// "Uploading Objects: 12 of 100 (100KB)"
"Uploading Objects: %@ of %@ (%@)" = "Téléversement des objets : %@ sur %@ (%@)";

// "Checking Out Files: 12 of 100"
"Checking Out Files: %@ of %@" = "Extraction des fichiers : %@ sur %@";


// SSH host key authentication
"The %@ %@ fingerprint is:\n%@" = "L’empreinte %@ %@ est :\n%@";


// Errors
"Error returned from libgit2: %@ (%ld)" = "Erreur renvoyée par libgit2 : %@ (%ld)";
"Error code from libgit2: (%ld)" = "Erreur renvoyée par libgit2 : (%ld)";

"The requested object was not found." = "L’objet demandé est introuvable.";
"The requested object already exists." = "L’objet demandé existe déjà.";
"Multiple ambiguous matching objects were found." = "Plusieurs objets correspondants ambigus ont été trouvés.";
"The provided buffer was too short." = "Le tampon fourni était trop court.";
"This operation cannot be performed on a bare repository." = "Cette opération ne peut pas être effectuée sur un référentiel vide.";
"The branch contains no commits." = "La branche ne contient aucune validation.";
"Unmerged changes must be resolved before the operation can be performed." = "Certaines modifications non fusionnées doivent être résolues avant d’exécuter l’opération.";
"The reference cannot be fast-forwarded and must instead be merged or rebased." = "La référence ne peut pas être avancée rapidement ; elle doit plutôt être fusionnée ou rebasée.";
"The provided reference name or refspec was invalid." = "La spécification (refspec) ou le nom de référence fourni était invalide.";
"One or more conflicts prevented the operation from being performed.\n\nCommit or stash any uncommitted changes and try again." = "Un ou plusieurs conflits ont empêché l’exécution de l’opération.\n\nValidez ou stashez les modifications non validées et réessayez.";
"There are locked files which prevented the operation from being performed." = "Des fichiers verrouillés ont empêché l’exécution de l’opération.";
"The reference has been modified by another operation." = "La référence a été modifiée par une autre opération.";
"Credentials were not accepted by the server. Make sure your password or SSH key is set up correctly.\n\nIf you are using an SSH config file, make sure it is not unexpectedly overriding options for the host." = "Les données d’identification n’ont pas été acceptées par le serveur. Assurez-vous que votre mot de passe ou clé SSH est correctement configuré.\n\nSi vous utilisez un fichier de configuration SSH, veillez à ce qu’il ne remplace pas de manière inattendue les options de l’hôte.";
"The certificate for the server is invalid. Make sure you have a valid secure connection to the server and that there is not a proxy server that may be downgrading security." = "Le certificat d’accès au serveur est invalide. Assurez-vous que vous disposez d’une connexion sécurisée valide au serveur et qu’aucun serveur proxy ne diminue le niveau de sécurité.";
"The provided patch or merge has already been applied." = "La fusion ou le patch fourni a déjà été appliqué.";
"The requested peel operation is not possible." = "L’opération peel demandée n’est pas possible.";
"An unexpected end of file was encountered." = "Fin de fichier inattendue rencontrée.";
"The requested operation or input is invalid." = "L’opération ou l’argument demandé est invalide.";
"There are uncommitted changes which must be committed or stashed before the operation can be performed." = "Des modifications non validées doivent être validées ou stashées avant d’exécuter l’opération.";
"This operation is not valid for the specified directory." = "Cette opération n’est pas valide pour le répertoire spécifié.";
"There are merge conflicts which must be resolved before the operation can be performed." = "Des conflits de fusion doivent être résolus avant d’exécuter l’opération.";
"The hash sum of one or more objects does not match." = "La somme de hachage d’un ou de plusieurs objets est différente.";
"Unsaved changes in the index would be overridden by the operation." = "Certaines modifications non enregistrées dans l’index seraient remplacées par l’opération.";
"Failed to apply the patch." = "L’application du patch a échoué.";
"The object is not owned by the current user." = "L’objet n’appartient pas à l’utilisateur actuel.";
"The operation was cancelled." = "L’opération a été annulée.";


// Tasks
"Failed to invoke Git “%@” hook." = "L’invocation du crochet “%@” Git a échoué.";
"Failed to invoke Git credential helper." = "L’invocation de l’utilitaire d’informations d’identification Git a échoué.";

"Task “%@” terminated with an uncaught signal." = "Tâche “%@” terminée avec signal non capturé.";
"Task “%@” terminated with a non-zero exit code: %d." = "Tâche “%@” terminée avec code de sortie non nul : %d.";


// Signing
"Invalid Git signing format specified." = "Le format de signature Git spécifié est invalide.";
"The “gpg.format” configuration value is set to “%@”, which is not supported." = "La valeur de configuration “gpg.format” est définie sur “%@”, ce qui n’est pas pris en charge.";
"Could not sign payload using %@." = "Impossible de signer le payload via %@.";
"A valid signing key was not provided using either `user.signingkey` or `gpg.ssh.defaultKeyCommand`." = "Aucune clé de signature valide n’a été fournie via “user.signingkey” ou “gpg.ssh.defaultKeyCommand”.";
"Task “%@” did not generate a signature in its output." = "La tâche “%@” n’a pas généré de signature dans son résultat.";


// Apply Stash
"Applying stash…" = "Application du stash…";
"Failed to apply stash." = "L’application du stash a échoué.";

// Checkout
"Checking out “%@”…" = "Extraction de “%@”…";
"Checking out HEAD…" = "Extraction de HEAD…";

"Failed to checkout tree." = "L’extraction de l’arbre a échoué.";

// Cherry-pick
"Cherry-picking “%@”…" = "Cherry-picking de “%@”…";

"Failed to cherry-pick commits." = "Les validations cherry-pick ont échoué.";

// Clone
"Cloning into “%@”…" = "Clonage dans “%@”…";

"Failed to clone repository." = "Le clonage du référentiel a échoué.";

// Commit
"Committing “%@”…" = "Validation de “%@”…";

"Failed to commit tree." = "La validation de l’arbre a échoué.";

// Fetch
"Fetching from “%@”…" = "Récupération à partir de “%@”…";
"Fetching “%@” from “%@”…" = "Récupération de “%@” à partir de “%@”…";
"Fetching %@ refs from “%@”…" = "Récupération des références %@ à partir de “%@”…";

"Failed to fetch from “%@”." = "La récupération à partir de “%@” a échoué.";

// List References
"Listing remote references for “%@”…" = "Création de la liste de références distantes à partir de “%@”…"; // Where a "reference" is a Git remote reference (such as a branch or tag)

"Failed to fetch remote references from “%@”." = "La récupération de références distantes à partir de “%@” a échoué."; // Where a "reference" is a Git remote reference (such as a branch or tag)

// Merge
"Merging “%@”…" = "Fusion de “%@”…";
"Merging %@ references…" = "Fusion des références %@…";

"Failed to merge references." = "La fusion des références a échoué.";

// Prune
"Pruning references for “%@”…" = "Élimination (“prune”) des références de “%@”…";

"Failed to prune remote references from “%@”." = "La suppression (“prune”) des références distantes à partir de “%@” a échoué.";

// Push
"Pushing to “%@”…" = "Poussée vers “%@”…";
"Pushing “%@” to “%@”…" = "Poussée de “%@” vers “%@”…";
"Pushing %@ refs to “%@”…" = "Poussée des références %@ vers “%@”…";

"Failed to push to “%@”." = "La poussée vers “%@” a échoué.";

"Failed to push some references." = "La poussée de certaines références a échoué.";
"One or more references were rejected by the server." = "Une ou plusieurs références ont été refusées par le serveur.";

// Update submodule
"Updating submodule “%@”…" = "Mise à jour du sous-module “%@”…";

"Failed to update submodule “%@”." = "La mise à niveau du sous-module a échoué.";
